IDEA Open Model
CrossSectionFactory.FillCssIarc Method
Compatible with IDEA StatiCa Beta 20.0
 Fill steel section of parametric I section
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public static void FillCssIarc(
	CrossSectionParameter css,
	double cssGeomB,
	double cssGeomH,
	double cssGeomS,
	double cssGeomT,
	double cssGeomR2,
	double tapperF,
	double r1
)
Public Shared Sub FillCssIarc (
	css As CrossSectionParameter,
	cssGeomB As Double,
	cssGeomH As Double,
	cssGeomS As Double,
	cssGeomT As Double,
	cssGeomR2 As Double,
	tapperF As Double,
	r1 As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
cssGeomB
Type: System.Double
Css width
cssGeomH
Type: System.Double
Height of cross-section
cssGeomS
Type: System.Double
Web thickness
cssGeomT
Type: System.Double
Flange thickness
cssGeomR2
Type: System.Double
inside radius
tapperF
Type: System.Double
Flange tapper
r1
Type: System.Double
Flange edge rounding radius
Return Value
Type:
Remarks
Dimension of parametric I section
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 8;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double cssGeomB = 0.25;
double cssGeomH = 0.45;
double cssGeomS = 0.02;
double cssGeomT = 0.03;
double cssGeomR2 = 0.012;
double tapperF = Math.PI / 180.0 * 5.0;
double r1 = 0.015;
CrossSectionFactory.FillCssIarc(css, cssGeomB, cssGeomH, cssGeomS, cssGeomT, cssGeomR2, tapperF, r1);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace